## Analysis for Chinese Idol Survival Shows (4 seasons)
### By Kristen Shen

In [7]:
import pandas as pd

In [8]:
df = pd.read_csv("IdolSurvivalShow.csv")
df.head(10)

            Name     Votes                 Company
0         Liu Yu  25959880         Biubiu Culture
1          Santa  16611343                    Avex
2       Rikimaru  16591943                    Avex
3           Mika  16255569                    Avex
4           Nine  13898339   Insight Entertainment
5         Lin Mo  13700082           Original Plan
6        Bo Yuan  13651294             White Media
7  Zhang Jiayuan  13612487  Wajijiwa Entertainment
8        Patrick  13359428   Insight Entertainment
9      Zhou Keyu  13279523          Jaywalk Newjoy

In [10]:
df["Company"].value_counts()

Company
Wajijiwa Entertainment    6
Avex                      3
Yuehua                    2
Insight Entertainment     2
Original Plan             2
White Media               2
Jaywalk Newjoy            2
Qigu Culture              1
Wenlan Culture            1
Long WuTian Culture       1
JC7                       1
Biubiu Culture            1
Mavericks                 1
K-L                       1
SDT Entertainment         1
Banana                    1
ReDu Music                1
JYP China                 1
Pelias                    1
Tai Du Yin Yue            1
TF Entertainment          1
Hot Idol                  1
Huaying Entertainment     1
TH Entertainment          1
SNH48                     1
The Voice of Dream        1
W8VES                     1
Babyou                    1
Name: count, dtype: int64

In [7]:
df[df['Company'] == "Wajijiwa Entertainment"]

             Name     Votes                 Company
7   Zhang Jiayuan  13612487  Wajijiwa Entertainment
18   Zhou Zhennan  37098540  Wajijiwa Entertainment
20     Yan Xu Jia  11164384  Wajijiwa Entertainment
21  Xia Zhi Guang  11107051  Wajijiwa Entertainment
23  Zhai Xiao Wen  10581322  Wajijiwa Entertainment
27       Zhao Lei   7503760  Wajijiwa Entertainment

In [8]:
df[df['Company'] == "Avex"]

       Name     Votes Company
1     Santa  16611343    Avex
2  Rikimaru  16591943    Avex
3      Mika  16255569    Avex

In [9]:
df[df['Company'] == "Insight Entertainment"]

      Name     Votes                Company
4     Nine  13898339  Insight Entertainment
8  Patrick  13359428  Insight Entertainment

In [10]:
df[df['Company'] == "Jaywalk Newjoy"]

          Name      Votes         Company
9    Zhou Keyu   13279523  Jaywalk Newjoy
13  Wang Yijin  148000008  Jaywalk Newjoy

In [11]:
df[df['Company'] == "Yuehua"]

          Name      Votes Company
29  Meng Meiqi  185244357  Yuehua
30   Wu Xuanyi  181533349  Yuehua

In [11]:
df[df['Company'] == "Original Plan"]

          Name     Votes        Company
5       Lin Mo  13700082  Original Plan
19  He Luo Luo  13652312  Original Plan

In [12]:
df[df['Company'] == "White Media"]

       Name     Votes      Company
6   Bo Yuan  13651294  White Media
26  Ren Hao   7511752  White Media